================================================================================
If
================================================================================

{% if 1 == 1 %}
  {{ 1 }}
  {{ 2 }}
  {{ 3 }}
{% endif %}

--------------------------------------------------------------------------------

(program
  (if_expression
    condition: (binary_expression
      left: (number)
      operator: (comparision_operator)
      right: (number))
    consequence: (block
      (number)
      (number)
      (number))))

================================================================================
If with empty body
================================================================================

{% if 1 == 1 %}
{% endif %}

--------------------------------------------------------------------------------

(program
  (if_expression
    (binary_expression
      (number)
      (comparision_operator)
      (number))))

================================================================================
If-else
================================================================================

{% if true %}
 {{ 1 }}
{% else %}
 {{ 1 }}
{% endif %}

--------------------------------------------------------------------------------

(program
  (if_expression
    condition: (boolean)
    consequence: (block
      (number))
    alternatives: (else_expression
      consequence: (block
        (number)))))

================================================================================
If-else with empty body
================================================================================

{% if true %}
{% else %}
{% endif %}

--------------------------------------------------------------------------------

(program
  (if_expression
    (boolean)
    (else_expression)))

================================================================================
If-elseif
================================================================================

{% if 1 == x %}
  {{ 1 }} {{ 2 }}
{% elseif 2 %}
  {{ 1 }} {{ 2 }}
{% elseif 5 %}
  {{ 1 }} {{ 2 }}
{% elseif 3 %}
  {{ 1 }} {{ 2 }}
{% else %}
  {{ 1 }} {{ 2 }}
{% endif %}

--------------------------------------------------------------------------------

(program
  (if_expression
    (binary_expression
      (number)
      (comparision_operator)
      (identifier))
    (block
      (number)
      (number))
    (elseif_expression
      (number)
      (block
        (number)
        (number)))
    (elseif_expression
      (number)
      (block
        (number)
        (number)))
    (elseif_expression
      (number)
      (block
        (number)
        (number)))
    (else_expression
      (block
        (number)
        (number)))))

================================================================================
If-elseif with empty body
================================================================================

{% if 1 == x %}
{% elseif 2 %}
{% elseif 5 %}
{% elseif 3 %}
{% else %}
{% endif %}

--------------------------------------------------------------------------------

(program
  (if_expression
    condition: (binary_expression
      left: (number)
      operator: (comparision_operator)
      right: (identifier))
    alternatives: (elseif_expression
      condition: (number))
    alternatives: (elseif_expression
      condition: (number))
    alternatives: (elseif_expression
      condition: (number))
    alternatives: (else_expression)))

================================================================================
Nested statements
================================================================================

{% if a %}
  {% if b %}
    {% if c %}
      {{ c }}
    {% endif %}
  {% endif %}
{% else %}
  {{ d }}
{% endif %}

--------------------------------------------------------------------------------

(program
  (if_expression
    condition: (identifier)
    consequence: (block
      (if_expression
        condition: (identifier)
        consequence: (block
          (if_expression
            condition: (identifier)
            consequence: (block
              (identifier))))))
    alternatives: (else_expression
      consequence: (block
        (identifier)))))
